tests/fixtures/get-order-cancellations.json

{
  "data": [
    {
      "confirmed_at": "2020-01-17T11:51:43.114803Z",
      "created_at": "2020-04-11T15:48:11.642Z",
      "expires_at": "2020-01-17T10:42:14.545052Z",
      "id": "ore_00009qzZWzjDipIkqpaUAj",
      "live_mode": false,
      "order_id": "ord_00009hthhsUZ8W4LxQgkjo",
      "refund_amount": "90.80",
      "refund_currency": "GBP",
      "refund_to": "arc_bsp_cash"
    }
  ],
  "meta": {
    "after": "g2wAAAACbQAAABBBZXJvbWlzdC1LaGFya2l2bQAAAB=",
    "limit": 50
  }
}